УчетВУправляющихДляГит1/src/Reports/РасходМатериаловПоПодразделениям/РасходМатериаловПоПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасходМатериаловПоПодразделениям</name>
</mdclass:Report>

УчетВУправляющихДляГит1/src/InformationRegisters/РасходМатериалов/РасходМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасходМатериалов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ОтветственныйЗаВыполнение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.КВП_ВидыСтатусовВыполненияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведенияРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.КВП_ВидыРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Здание</name>
    <type>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияВыполняемыхРабот</name>
    <type>
      <types>CatalogRef.УПЖКХ_КатегорииРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.КВП_ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Reports/РасходМатериаловПоПодразделениям/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = Отчеты.РасходМатериаловПоПодразделениям.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходМатериалов.Период,
		|	РасходМатериалов.Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Регистратор),
		|	РасходМатериалов.НомерСтроки,
		|	РасходМатериалов.Активность,
		|	РасходМатериалов.Склад,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Склад),
		|	РасходМатериалов.Подразделение,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Подразделение),
		|	РасходМатериалов.Здание,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Здание),
		|	РасходМатериалов.КатегорияВыполняемыхРабот,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.КатегорияВыполняемыхРабот),
		|	РасходМатериалов.ВидРабот,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.ВидРабот),
		|	РасходМатериалов.Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Номенклатура),
		|	РасходМатериалов.Цена,
		|	РасходМатериалов.Сумма,
		|	РасходМатериалов.Количество,
		|	РасходМатериалов.ЕдиницаИзмерения,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.ЕдиницаИзмерения),
		|	РасходМатериалов.ОтветственныйЗаВыполнение,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.ОтветственныйЗаВыполнение),
		|	РасходМатериалов.СтатусВыполнения,
		|	РасходМатериалов.ФлагВыполнения,
		|	РасходМатериалов.МестоПроведенияРабот,
		|	РасходМатериалов.Ответственный,
		|	ПРЕДСТАВЛЕНИЕ(РасходМатериалов.Ответственный)
		|ИЗ
		|	РегистрСведений.РасходМатериалов КАК РасходМатериалов
		|ГДЕ
		|	РасходМатериалов.Период МЕЖДУ &Период1 И &Период2
		|	И РасходМатериалов.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Период1", период.ДатаНачала);
	Запрос.УстановитьПараметр("Период2", период.ДатаОкончания);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
